In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/anvarnarz/praktikum_datasets/main/world_population_duplicates.csv', usecols=['country','pop2021','area'], index_col='country')
df.head()

           pop2021   area
country
Macau      658.394     30
Monaco      39.511      2
Burundi  12255.433  27834
Macau      658.394     30
Monaco      39.511      2

In [4]:
df.loc['Uzbekistan']

pop2021     33935.763
area       447400.000
Name: Uzbekistan, dtype: float64

In [6]:
bins = [0, 1000, 10000, 30000, 50000, 100000, 300000, 1500000]
population = df.pop2021
population

country
Macau                 658.394
Monaco                 39.511
Burundi             12255.433
Macau                 658.394
Monaco                 39.511
                      ...
Namibia              2587.344
Western Sahara        611.875
Mongolia             3329.289
Falkland Islands        3.533
Greenland              56.877
Name: pop2021, Length: 247, dtype: float64

In [10]:
group = pd.cut(population, bins)
group

country
Macau                    (0, 1000]
Monaco                   (0, 1000]
Burundi             (10000, 30000]
Macau                    (0, 1000]
Monaco                   (0, 1000]
                         ...
Namibia              (1000, 10000]
Western Sahara           (0, 1000]
Mongolia             (1000, 10000]
Falkland Islands         (0, 1000]
Greenland                (0, 1000]
Name: pop2021, Length: 247, dtype: category
Categories (7, interval[int64, right]): [(0, 1000] < (1000, 10000] < (10000, 30000] < (30000, 50000] < (50000, 100000] < (100000, 300000] < (300000, 1500000]]

In [11]:
group.value_counts()

pop2021
(0, 1000]            80
(1000, 10000]        73
(10000, 30000]       46
(30000, 50000]       19
(50000, 100000]      15
(100000, 300000]     11
(300000, 1500000]     3
Name: count, dtype: int64

In [12]:
df['group'] = group
df.head()

           pop2021   area           group
country
Macau      658.394     30       (0, 1000]
Monaco      39.511      2       (0, 1000]
Burundi  12255.433  27834  (10000, 30000]
Macau      658.394     30       (0, 1000]
Monaco      39.511      2       (0, 1000]

In [29]:
df = pd.read_csv("https://github.com/anvarnarz/praktikum_datasets/raw/main/automobile_data_nan.csv", index_col=0)
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,NaN,21.0,13495.0
1,alfa-romero,convertible,NaN,168.8,dohc,four,111.0,21.0,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154.0,NaN,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102.0,24.0,13950.0
4,audi,sedan,99.4,176.6,ohc,five,NaN,NaN,17450.0

In [30]:
df.price.describe()

count       58.000000
mean     15387.000000
std      11320.259841
min       5151.000000
25%       6808.500000
50%      11095.000000
75%      18120.500000
max      45400.000000
Name: price, dtype: float64

In [21]:
bins = [0, 10000, 20000, 50000]
range = pd.cut(df.price, bins)

In [22]:
range.value_counts()

price
(0, 10000]        28
(10000, 20000]    17
(20000, 50000]    13
Name: count, dtype: int64

In [26]:
names = ["cheap", "moderate", "expensive"]
range = pd.cut(df.price, bins, labels=names)
range

index
0     moderate
1     moderate
2     moderate
3     moderate
4     moderate
        ...
81       cheap
82       cheap
86       cheap
87    moderate
88    moderate
Name: price, Length: 61, dtype: category
Categories (3, object): ['cheap' < 'moderate' < 'expensive']

In [28]:
range.value_counts()

price
cheap        28
moderate     17
expensive    13
Name: count, dtype: int64

In [27]:
df['range'] = range
df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,range
index,,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,NaN,21.0,13495.0,moderate
1,alfa-romero,convertible,NaN,168.8,dohc,four,111.0,21.0,16500.0,moderate
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154.0,NaN,16500.0,moderate
3,audi,sedan,99.8,176.6,ohc,four,102.0,24.0,13950.0,moderate
4,audi,sedan,99.4,176.6,ohc,five,NaN,NaN,17450.0,moderate
...,...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85.0,27.0,7975.0,cheap
82,volkswagen,sedan,NaN,171.7,NaN,four,52.0,37.0,7995.0,cheap
86,volkswagen,sedan,97.3,NaN,ohc,four,100.0,NaN,9995.0,cheap
87,volvo,sedan,104.3,188.8,NaN,four,114.0,23.0,12940.0,moderate
88,volvo,wagon,104.3,188.8,ohc,four,NaN,23.0,13415.0,moderate

In [32]:
range = pd.cut(df.price, 5)
range.value_counts()

price
(5110.751, 13200.8]    32
(13200.8, 21250.6]     14
(29300.4, 37350.2]      7
(37350.2, 45400.0]      3
(21250.6, 29300.4]      2
Name: count, dtype: int64

In [35]:
range = pd.qcut(df.price, 5)
range.value_counts()

price
(5150.999, 6604.6]    12
(7959.6, 13589.2]     12
(23719.2, 45400.0]    12
(6604.6, 7959.6]      11
(13589.2, 23719.2]    11
Name: count, dtype: int64